<?php
//------------------------------------------------------------
/**
 * Установки лог файла
 *
 */
//------------------------------------------------------------
define("DEFAULTLOGFILENAME", "dmoz.log", true);
define("BREAKLOGFILE", "*************************************", true);
//- 
define("OPENLOGEERROR", "Невозможно открыть лог файл для записи: ", true);
define("WRITELOGERROR", "Невозможно записать данные в лог файл!!!", true);
//------------------------------------------------------------
?>