/*/------------------------------------------------------------------------/*/
/*/    Различные классы и функции, которые следует рассортировать позже    /*/
/*/------------------------------------------------------------------------/*/
#ifndef HeadFile_H
#define HeadFile_H
/*/------------------------------------------------------------------------/*/
//Библиотеки
#include <vcl.h>
#pragma hdrstop
/*/------------------------------------------------------------------------/*/
//Прототипы функций
//-----------------
double Round(double);         //Функция округления дробного числа до ближайшего целого
double Modul(double);         //Функция возвращаает модуль числа
/*/------------------------------------------------------------------------/*/
//Классы
//-----------------
/*/------------------------------------------------------------------------/*/
//Реализация функций
//-----------------
//Функция округления дробного числа до ближайшего целого 
double Round(double Var)
   {
      bool sign = false;
      if (Var < 0) {sign = true; Var = Var * (-1);}
      int Help = Var;
      double VarHelp = Var - Help;
      if (VarHelp > 0.5)
         {
            if (!sign)
               {return(int(Var+1));}
            else
               {
                  Var += 1;
                  return(int(Var*(-1)));
               }
         }
      else
         {
            if (!sign)
              {return(int(Var));}
            else
               {
                  return(int(Var*(-1)));
               }
         }
   }
/*/------------------------------------------------------------------------/*/
//Функция возвращаает модуль числа
double Modul(double Variable)
   {
      if (Variable < 0)
         {
            return (Variable * (-1));
         }
      else
         {
            return (Variable);
         }
   }
/*/------------------------------------------------------------------------/*/
#endif
/*/------------------------------------------------------------------------/*/
